# Project 2 Tests

In [26]:
# Import libraries
import pandas as pd

## Part 2

In [27]:
# Import py file 
from db_connection import create_connection

In [28]:
# Create database connection using valid vault file
engine = create_connection("vault.txt")

In [31]:
# Verify connection works by querying the account table
pd.read_sql_query("""SELECT * 
                     FROM transaction
                     LIMIT 5""", engine)

,txn_id,txn_date,account_id,txn_type_cd,amount,teller_emp_id,execution_branch_id,funds_avail_date,trial104
0,1,2000-01-15,1,CDT,100.0,None,None,2000-01-15,T
1,2,2000-01-15,2,CDT,100.0,None,None,2000-01-15,T
2,3,2004-06-30,3,CDT,100.0,None,None,2004-06-30,T
3,4,2001-03-12,4,CDT,100.0,None,None,2001-03-12,T
4,5,2001-03-12,5,CDT,100.0,None,None,2001-03-12,T

In [30]:
# Test error handling by providing an invalid vault filename
engine2 = create_connection("vaults.txt")

FileNotFoundError: [Errno 2] No such file or directory: 'vaults.txt'

In [37]:
pd.read_sql_query("""SELECT * FROM transaction""", engine)

,txn_id,txn_date,account_id,txn_type_cd,amount,teller_emp_id,execution_branch_id,funds_avail_date,trial104
0,1,2000-01-15,1,CDT,100.0,None,None,2000-01-15,T
1,2,2000-01-15,2,CDT,100.0,None,None,2000-01-15,T
2,3,2004-06-30,3,CDT,100.0,None,None,2004-06-30,T
3,4,2001-03-12,4,CDT,100.0,None,None,2001-03-12,T
4,5,2001-03-12,5,CDT,100.0,None,None,2001-03-12,T
5,6,2002-11-23,7,CDT,100.0,None,None,2002-11-23,T
6,7,2002-12-15,8,CDT,100.0,None,None,2002-12-15,T
7,8,2003-09-12,10,CDT,100.0,None,None,2003-09-12,T
8,9,2000-01-15,11,CDT,100.0,None,None,2000-01-15,T
9,10,2004-09-30,12,CDT,100.0,None,None,2004-09-30,T
10,11,2004-01-27,13,CDT,100.0,None,None,2004-01-27,T
11,12,2002-08-24,14,CDT,100.0,None,None,2002-08-24,T
12,13,2004-12-28,15,CDT,100.0,None,None,2004-12-28,T
13,14,2004-01-12,17,CDT,100.0,None,None,2004-01-12,T
14,15,2001-05-23,18,CDT,100.0,None,None,2001-05-23,T
15,16,2001-05-23,19,CDT,100.0,None,None,2001-05-23,T
16,17,2003-07-30,21,CDT,100.0,None,None,2003-07-30,T
17,18,2004-10-28,22,CDT,100.0,None,None,2004-10-28,T
18,19,2004-06-30,23,CDT,100.0,None,None,2004-06-30,T
19,20,2002-09-30,24,CDT,100.0,None,None,2002-09-30,T
20,21,2003-07-30,28,CDT,100.0,None,None,2003-07-30,T

In [38]:
data = [-1] * 2
pd.DataFrame(data, columns = "txn_date", "txt_id")

SyntaxError: positional argument follows keyword argument (1901312617.py, line 2)